; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 544857 2 2 4 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	infrared1 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star2 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
)
(:goal (and
	(have_image Planet7 thermograph2)
	(have_image Planet8 infrared1)
	(have_image Planet9 spectrograph0)
	(have_image Star10 spectrograph0)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite0 star10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star10)
   goals met: 0 of 6
4. (turn_to satellite1 star2 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star2)
   goals met: 0 of 6
5. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 6
6. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 0 of 6
7. (turn_to satellite1 star10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star10)
   goals met: 0 of 6
8. (turn_to satellite0 star5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star5)
   goals met: 0 of 6
9. (take_image satellite1 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 1 of 6
10. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 1 of 6
11. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 1 of 6
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 6
13. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   goals met: 1 of 6
14. (take_image satellite1 planet9 instrument2 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 2 of 6
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
16. (turn_to satellite0 planet11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet11)
   goals met: 2 of 6
17. (turn_to satellite1 planet8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet8)
   goals met: 2 of 6
18. (turn_to satellite0 phenomenon12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 6
19. (take_image satellite1 planet8 instrument2 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 3 of 6
20. (turn_to satellite0 planet11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet11)
   goals met: 3 of 6
21. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 3 of 6
22. (turn_to satellite0 phenomenon12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 6
23. (take_image satellite1 planet7 instrument2 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 4 of 6
24. (turn_to satellite0 groundstation3 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation3)
   goals met: 4 of 6
25. (turn_to satellite1 planet11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet11)
   goals met: 4 of 6
26. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 4 of 6
27. (take_image satellite1 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 5 of 6
28. (turn_to satellite0 phenomenon12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 6
29. (take_image satellite0 phenomenon12 instrument0 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 6 of 6
